tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "tektoncd/tools"
brew "gcc"
brew "open-mpi"
brew "bochs"
brew "clisp"
brew "ffmpeg"
brew "fftw"
brew "gh"
brew "git"
brew "pango"
brew "gnuplot"
brew "go"
brew "graphviz"
brew "helm"
brew "libheif"
brew "imagemagick"
brew "kubernetes-cli"
brew "maven"
brew "minikube"
brew "mysql"
brew "node"
brew "suite-sparse"
brew "sundials"
brew "octave"
brew "pipenv"
brew "postgresql"
brew "rust"
brew "snobol4"
brew "sox"
brew "starship"
brew "swi-prolog"
brew "tree"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "tektoncd/tools/tektoncd-cli"
cask "anaconda"
cask "docker"
cask "hyper"
cask "joplin"
cask "visual-studio-code"
cask "font-fira-code"
cask "postgres"
cask "firefox"
cask "google-chrome"
cask "slack"
cask "hyper"
cask "insomnia"

